<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" 		"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">
      <head>
            <meta name="author" content="SigVDR" />
            <meta name="description" content="EasyKontakt - Kontaktverwaltung f&#252;r Linux und Windows. - <br />
            Kontakte verwalten - f&#252;r Smartphone(Android), Fritz.Box, Thunderbird ..." />
            <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
            <meta http-equiv="content-language" content="de" />
            <meta name="generator" content="EasyWebitor by SigVDR" />
            <meta name="robots" content="all" />
            <meta name="date" content="2019-04-04T17:42:38+0100" />
            <meta name="keywords" content="EasyKontakt - Kontaktverwaltung f&#252;r Linux und Windows. Smartphone Android Fritzbox Thunderbird VCard Kontakte Adressbuch Telefonbuch" />
            <title>EasyKontakt - Kontaktverwaltung f&#252;r Linux und Windows.</title>
            <link rel="stylesheet" type="text/css" href="form.css" />
            <link rel="stylesheet" type="text/css" href="form_header.css" />
            <link rel="stylesheet" type="text/css" href="form_menu.css" />
            <link rel="stylesheet" type="text/css" href="form_vorlagen.css" />
            <!--[if lt IE 7]>
            <link rel="stylesheet" type="text/css" href="form_ie6.css" />
            <![endif]-->
            <style type="text/css">
            </style>
      </head>
      <body>
            <div class="frame">
                  <div class="header_backgnd">
                        <img src="img/header.png" />
                        <div class="header_logo">
                              <img src="img/EasyKontakt.png" />
                        </div>
                        <div class="title">
                              <img src="img/e25.png">asyKontakt
                        </div>
                        <div class="subtitle">
                              <br />
                              Kontakte verwalten - f&#252;r Smartphone(Android), Fritz.Box, Thunderbird ...
                        </div>
                        <div class="slogan">
                              Free Cross Platform Development
                        </div>
                        <div class="homelink">
                              <a href="http://www.sigvdr.de/Software/EasyStream/EasyStream.html">SigVDR</a>
                        </div>
                  </div>
                  <div class="menuoben">
                        <a class="selected" href="EasyKontakt.html"><img src="img/blind.gif" width = "0" height="10">EasyKontakt</a>
                        <a  href="export.html"><img src="img/blind.gif" width = "0" height="10">Export</a>
                        <a  href="import.html"><img src="img/blind.gif" width = "0" height="10">Import</a>
                  </div>
                  
                  <div>
                        <div class="content">
                              
                              Mit EasyKontakt lassen sich die Kontaktdaten f&#252;r verschiedene Programme oder Ger&#228;te zentral verwalten und austauschen, f&#252;r den Datenaustausch wird das weit verbreitete <b>vCard Format</b> verwendet.
                              <br />
                              <h2><a name="Features">Features</a></h2>
                              <div class="highlight2">
                                    Klarstellung: Die Kontaktdaten werden <b>nicht direkt</b> aus den <b>Ger&#228;ten/Programmen ausgelesen</b>, sondern eine vom Ger&#228;t/Programm erstellte und auf den PC kopierte Kontaktdatendatei kann in EasyKontakt importiert werden.
                                    <br />
                              </div>
                              EasyKontakt:
                              <br />
                              <ul>
                                    <li>speichert die Kontaktdaten im weit verbreiteten VCard - Format</li>
                                    <li>Importiert Kontaktdaten</li>
                                    <ul>
                                          <li>von Smartphones wie z.B. Android ( .vcf in der Version 2.1)</li>
                                          <li>von der Fritz.Box (.xml)</li>
                                          <li>von Thunderbird (Komma getrennte Liste .csv)</li>
                                    </ul>
                                    <li>Exportiert Kontaktdaten</li>
                                    <ul>
                                          <li>als VCard Datei zu Smartphones</li>
                                          <li>als einzelner Kontakt &#252;ber ein QR-Code Image direkt ins Smartphone</li>
                                          <li>als VCard Datei zu Thunderbird</li>
                                          <li>als Fritz.Box XML Datei</li>
                                    </ul>
                                    <li>&#214;ffnet mehrere Kontaktdaten Dateien gleichzeitig und erm&#246;glicht so den einfachen Datenaustausch zw. den Dateien</li>
                                    <li>Datenaustausch zu anderen Programmen &#252;ber die Zwischenablage im VCard Format</li>
                                    <li>Undo: &#196;nderungen verwerfen</li>
                                    <ul>
                                          <li>f&#252;r Eintr&#228;ge</li>
                                          <li>f&#252;r Kontakte</li>
                                          <li>oder f&#252;r die ganze Kontaktliste</li>
                                    </ul>
                                    <li>selektive Auswahl der zu exportierenden Daten</li>
                                    <ul>
                                          <li>f&#252;r unterschiedliche Ziele oder Benutzer</li>
                                          <li>Wahlweise Abh&#228;ngigkeit von Datenverf&#252;gbarkeit</li>
                                          <ul>
                                                <li>z.B. Nur Datens&#228;tze die eine Telefonnumer enthalten sollen f&#252;r das Smartphone exportiert werden</li>
                                                <li>z.B. Nur Datens&#228;tze die eine E-Mail adresse enthalten sollen f&#252;r Thunderbird exportiert werden</li>
                                          </ul>
                                          <li>auf Wunsch mit reduziertem Dateninhalt</li>
                                    </ul>
                                    <li>Entsprechend der VCard Spezifikation gibt es f&#252;r jeden Kontakt Bearbeitungsmodule f&#252;r:</li>
                                    <ul>
                                          <li>den Vollst&#228;ndigen Namen</li>
                                          <li>Fotos oder Icons</li>
                                          <li>Telefonnummern (beliebige Anzahl)</li>
                                          <li>E-Mail Adressen (beliebige Anzahl)</li>
                                          <li>Post Adressen (beliebige Anzahl)</li>
                                          <li>Datumseintr&#228;ge / Termine</li>
                                          <li>Notizen</li>
                                          <li>Weitere Bearbeitungsmodule k&#246;nnen per Konfigurationsdatei hinzugef&#252;gt werden</li>
                                    </ul>
                                    <li>VCard Eigenschaften die noch nicht von einem EasyKontakt Bearbeitungsmodul unterst&#252;tzt werden gehen nicht verloren.</li>
                              </ul>
                              <h2><a name="Screenshot">Screenshot</a></h2>
                              <a href="img/EasyKontakt/EasyKontakt.png"><img class="imgcenter" src="img/EasyKontakt/EasyKontakt.png" alt="/img/EasyKontakt/EasyKontakt.png"/></a>
                              <br />
                              <h2><a name="Beschreibung">Beschreibung</a></h2>
                              Die Kontaktdaten von Smartphones (zumindest bei Android Ger&#228;ten) k&#246;nnen im <a href="http://de.wikipedia.org/wiki/VCard">vCard</a> Format exportiert und importiert werden. EasyKontakt nutzt genau dieses Format um Kontaktdaten wie Telefonnummern, E-Mail Adressen und Postadressen zu verwalten. &#220;ber Importmodule kann EasyKontakt zus&#228;tzlich auch die Adress/Telefonb&#252;cher vom E-Mail Programm Thunderbird, von einer Fritz.Box und vielen anderen Quellen importieren. Import bedeutet hier aber nicht, dass die Daten automatisch in eine bereits bestehendes Adressbuch integriert werden, EasyKontakt erstellt einfach ein neues Adressbuch im vCard Format (&#252;bliche Dateiendung ist <b>.vcf</b>) und &#246;ffnet es in einem neuen Register (Tab).
                              <br />
                              <br />
                              Weil in EasyKontakt mehrere Adressb&#252;cher gleichzeitig ge&#246;ffnet werden k&#246;nnen, lassen sich auch die Kontaktdaten &#252;ber die Zwischenablage leicht zwischen den Adressb&#252;chern austauschen. So kann schnell aus den verschiedenen Quellen ein einziges zentrales Adressbuch entstehen.
                              <br />
                              <br />
                              Aus diesem zentralen Adressbuch k&#246;nnen dann die verschiedenen Zielger&#228;te mit den aktuellen Kontaktdaten versorgt werden. Es stellt sich aber jetzt die Frage: Ben&#246;tige ich wirklich alle Daten des Adressbuches auf jedem Zielger&#228;t oder Programm? Wir ben&#246;tigen also eine f&#252;r jedes Zielger&#228;t oder Zielprogramm zugeschnittene Selektionm&#246;glichkeit.
                              <br />
                              <h3><a name="Kontaktauswahl">Kontaktauswahl</a></h3>
                              <a href="img/EasyKontakt/EasyKontakt-Checklist.png"><img style="float:right" src="img/EasyKontakt/EasyKontakt-Checklist.png" alt="/img/EasyKontakt/EasyKontakt-Checklist.png"/></a>
                              <br />
                              Wenn mehrere Personen das Adressbuch als gemeinsame Basis benutzen enth&#228;lt es mit Sicherheit auch Kontakteintr&#228;ge die nicht jeder ben&#246;tigt. Deshalb kann mit EasyKontakt f&#252;r veschiedene Ziele oder Benutzer eine selektive Auswahl der Kontakte vorgenommen werden.
                              <br />
                              So kann Beispielsweise f&#252;r das Smartphone von Max eine andere Auswahl getroffen werden wie f&#252;r das Smartphone von Moritz.
                              <br />
                              <div class="highlight2">
                                    Die Kontaktauswahl ist nur dann aktiv, wenn eine benutzerdefinierte Liste ausgew&#228;hlt ist.
                                    <br />
                                    Im Bild dargestellt, ist <b>FritzBox</b> als benutzerdefinierte Liste gew&#228;hlt.
                                    <br />
                              </div>
                              <h3><a name="Datenauswahl">Datenauswahl</a></h3>
                              <a href="img/EasyKontakt/EasyKontakt-Select.png"><img style="float:right" src="img/EasyKontakt/EasyKontakt-Select.png" alt="/img/EasyKontakt/EasyKontakt-Select.png"/></a>
                              <br />
                              Adressdaten in einer Fritz.Box zu speichern macht nicht wirklich Sinn und ob Telefonnummern im Adressbuch des E-Mail Programms sinnvoll sind soll jeder selbst f&#252;r sich entscheiden. Mit EasyKontakt l&#228;sst sich der Dateninhalt f&#252;r verschiedene Ziele unterschiedlich ausw&#228;hlen.
                              <br />
                              <br />
                              <dl>
                                    <dt>Eine Auswahlbox in der Liste kann 3 Zust&#228;nde annehmen</dt>
                                    <dd><b>leer</b> - Diese Eintr&#228;ge werden nicht im Ziel gespeichert.</dd>
                                    <dd><b>ausgew&#228;hlt</b> - Fehlt dieser Eintrag im Kontaktdatensatz wird der ganze Datensatz nicht im Ziel gespeichert.</dd>
                                    <dd><b>markiert</b> - Diese Eintr&#228;ge werden im Ziel gespeichert.</dd>
                              </dl>
                              <br />
                              Das im Bild gezeigte Beispiel bedeutet:
                              <br />
                              Von diesem Kontaktdatensatz werden nur die Eintr&#228;ge f&#252;r E-Mail und Telefonnummer in der Zieldatei gespeichert, aber nur dann, wenn im Datensatz eine Telefonnummer enthalten ist.
                              <br />
                              <br />
                              <div class="highlight2">
                                    Bei einigen Linuxdistributionen ist der 3.Zustand <b>markiert</b> nicht eindeutig erkennbar. Mit EasyKontakt.css l&#228;sst sich dieser Mangel zumindest f&#252;r des Programm selbst beheben.
                                    <br />
                              </div>
                              Datei: <b>$HOMEDIR/EasyApps/EasyKontakt/EasyKontakt.css</b>
                              <br />
<pre> QCheckBox::indicator:checked &#123;
   image: url(:&#47;img&#47;img&#47;checkbox-checked.png);
&#125;
QCheckBox::indicator:unchecked &#123;
   image: url(:&#47;img&#47;img&#47;checkbox-unchecked.png);
&#125;
QCheckBox::indicator:indeterminate &#123;
    image: url(:&#47;img&#47;img&#47;checkbox-partiallychecked.png);
 &#125;
</pre>
                              <h2><a name="Datumsformat">Datumsformat</a></h2>
                              In der Spezifikation des VCard Formates <b>RFC 6350</b> ist das zu verwendende Datumsformat eindeutig definiert mit
                              <br />
                              <dl>
                                    <dt> yyyyMMdd </dt>
                                    <dd> yyyy ist die 4-stellige Jahreszahl</dd>
                                    <dd> MM ist der 2-stellige Monat ( also notfalls mit einer f&#252;hrenden "0")</dd>
                                    <dd> dd ist der 2-stellige Tag des Monates (  notfalls auch wieder mit einer f&#252;hrenden "0") </dd>
                              </dl>
                              <br />
                              Leider h&#228;lt sich nicht jede Software an genau diese Definition und wenn EasyKontakt die Kontaktdaten mit solchen Programmen gemeinsam benutzen soll, l&#228;sst sich diese Vorgabe seit EasyKontakt 0.1-50 in der Konfigurationsdatei <b>EasyKontakt.conf</b> &#228;ndern.
                              <br />
                              <br />
                              <div class="highlight1">
                                    VCARD-DATEFORMAT=yyyyMMdd;yyyy-MM-dd
                                    <br />
                              </div>
                              Die durch Strichpunkt <b>";"</b> getrennte Liste gibt die M&#246;glichen Formate f&#252;r das einzulesende Datumsformat an. <b>Gespeichert wird das Datum dann im Format des ersten Eintrages</b> in der Liste.
                              <br />
                              <div class="highlight4">
                                    Achtung: nur bei &#196;nderungen wird das Datum neu geschrieben
                                    <br />
                                    Achtung: bitte exakt die Gro&#223;/Kleinschreibung beachten! MM f&#252;r Monat mit Gro&#223;buchstaben, der Rest alles klein.
                                    <br />
                              </div>
                              <h2><a name="Konfiguration">Konfiguration</a></h2>
                              Zur Bearbeitung der einzelnen vCard Eintr&#228;ge stehen verschiedene Editoren  zur Verf&#252;gung(in der Konfigurationsdatei <b>ObjektTyp</b> genannt). In der Konfigurationsdatei <b>VCardItems.conf</b> sind die verf&#252;gbaren Editoren definiert und k&#246;nnen auch noch weitere hinzugef&#252;gt werden.
                              <br />
                              VCardItems.conf is zu finden in:
                              <br />
                              <dl>
                                    <dt>Windows </dt>
                                    <dd>im Ordner help\VCardItems.conf des EasyKontakt-Programmordners.</dd>
                                    <dt>Linux</dt>
                                    <dd>in /usr/share/EasyKontakt/VCardItems.conf</dd>
                              </dl>
                              Beispiel <b>VCardItems.conf</b>
                              <br />
<pre>&#47;&#47; Beginn Kommentar
&#47;&#47; &#91;KEY&#93;  Schl&#252;sselname wie von VCard definiert
&#47;&#47; Item=Schl&#252;sselname;&#220;bersetzung;Neu;ObjektTyp;Exclusive
&#47;&#47;      Schl&#252;sselname - exakt gleich wie &#91;KEY&#93;
&#47;&#47;      &#220;bersetzung - des Schl&#252;sselnamen
&#47;&#47;      Neu - Vorbelegung eines neuen Eintrages
&#47;&#47;      ObjektTyp - 0=Name; 1=Einzeiler; 2=Adresse; 3=Bild; 4=Datum&#47;Zeit; 5=Notizen
&#47;&#47;      exclusive - wenn nur ein g&#252;ltiger Eintrag m&#246;glich sein soll &#33;kleinbuchstaben verwenden 
&#47;&#47; OptionList=Eigenschaften zum Schl&#252;ssel wie von VCard definiert
&#47;&#47; Translation=&#220;bersetzung der Eigenschaften
&#47;&#47; ExtraParameter=Anzahl der Zusatzparameter f&#252;r Einzeiler (ObjektTyp 1)   
&#47;&#47; End Kommentar
&#91;N&#93;
&#47;&#47; Hier werden keine Parameter ben&#246;tigt
&#91;PHOTO&#93;
Item=PHOTO;Bild;;3;exclusive
OptionList=
Translation=
ExtraParameter=
&#91;TEL&#93;
Item=TEL;Telefonnummer;+49 ;1;
OptionList=USER DEFINED;VOICE;CELL;FAX;;VIDEO;PAGER;TEXT;TEXTPHONE
Translation=BENUTZERDEFINIERT;FESTNETZ;MOBIL;FAX;VIDEO;PAGER;TEXT;TEXTPHONE
ExtraParameter=2
&#91;EMAIL&#93;
Item=EMAIL;E-Mail;;1;
OptionList=USER DEFINED;INTERNET;X400
Translation=BENUTZERDEFINIERT;INTERNET;X400
ExtraParameter=0
&#91;ADR&#93;
Item=ADR;Adresse;;2;
OptionList=USER DEFINED;DOM;INTL;POSTAL;PARCEL
Translation=BENUTZERDEFINIERT;LOKAL;INTERNATIONAL;POST;PAKET
ExtraParameter=0</pre>
                              Um dieser konfigurationsdatei eine Definition f&#252;r z.B. den Geburtstag hinzuzuf&#252;gen gehen wir so vor:
                              <br />
                              <dl>
                                    <dt>&#91;BDAY&#93; </dt>
                                    <dd> der VCard Schl&#252;ssel f&#252;r den Geburtstag</dd>
                                    <dt>Item=BDAY;Geburtstag;$DATE;4</dt>
                                    <dd> $DATE $TIME $DATETIME definiert die Art der Zeitangabe</dd>
                                    <dd> ObjektTyp 4 f&#252;r Zeit/Datum</dd>
                                    <dt>OptionList=:</dt>
                                    <dd>F&#252;r den Geburtstag ben&#246;tigen wir keine Eigenschaften</dd>
                                    <dt>Translation=</dt>
                                    <dd>somit auch keine &#220;bersetzung</dd>
                                    <dt>ExtraParameter=0</dt>
                              </dl>
                              Wie erg&#228;nzen also VCardItems.conf mit:
                              <br />
<pre>&#91;BDAY&#93;
Item=BDAY;Geburtstag;$DATE;4
OptionList=:
Translation=
ExtraParameter=0</pre>
                              <div class="highlight4">
                                    nach dieser Vorgehensweise lassen sich auch Eintr&#228;ge konfigurieren, die nicht durch die vCard Spezifikation definiert sind. Die Nutzung dieser Eintr&#228;ge bleibt dann aber auf das Programm EasyKontakt beschr&#228;nkt.
                                    <br />
                              </div>
                              <h2><a name="StyleSheet">StyleSheet</a></h2>
                              Das Design von EasyKontakt kann durch ein StyleSheet angepasst werden. Dieses StyleSheet orientiert sich an dem CSS Standard der f&#252;r die Webseiten Erstellung benutzt wird. Dazu wird diese Datei verwendet:
                              <br />
                              <dl>
                                    <dt>Windows</dt>
                                    <dd>&#91;EasyKontakt-Programmordner&#93;\EasyKontakt.css</dd>
                                    <dt>Linux</dt>
                                    <dd>&#91;HOME&#93;&#47;EasyApps&#47;EasyKontakt&#47;EasyKontakt.css</dd>
                              </dl>
                              Um die Nutzung des individuellen Designs zu verhindern, kann EasyKontakt (mit einem Beliebigen Editor) ge&#246;ffnet werden und der Inhalt gel&#246;scht und duch die Zeichenfolge /**/ ersetzt werden.
                              <br />
                              Wird die ganze Datei oder der Inhalt der Datei komplett gel&#246;scht, erstellt EasyKontakt eine neue StyleSheet Datei.
                              <br />
                              <h2><a name="Changelog">Changelog</a></h2>
                              <dl>
                                    <dt>EasyKontakt 0.2-3</dt>
                                    <dd> Export nach FritzBox: Speichern als "Fritz.exchange Format" vertauscht Vornamen mit Nachnamen da die Fritzbox nicht umsortieren kann.</dd>
                                    <dd> Vertauschen von Vornamen und Nachnamen - im ge&#246;ffneten Kontakt oder in der ganzen Liste. </dd>
                                    <dd> Weitere Kontaktdaten in bestehende Liste einf&#252;gen/Einlesen von mehreren VCF Dateien auf einmal.</dd>
                                    <dd> Fehlenden Button zum Export hinzugef&#252;gt.</dd>
                                    <dd>Bugfix: "Sonderzeichen in den Namen wie z.B. "&lt;&gt;& k&#246;nnen jetzt verwendet werden.</dd>
                                    <dt>EasyKontakt 0.1-54</dt>
                                    <dd>Bugfix: ENCODING=QUOTED-PRINTABLE -> Mehrzeilige Eintr&#228;ge sind jetzt m&#246;glich</dd>
                                    <dd>Anzeige undefinierter Eigenschaften &#252;ber "Fallback" Modul</dd>
                                    <dd>Android-Custom Eigenschaften sind in VCardItems.conf definierbar</dd>
                                    <dt>EasyKontakt 0.1-50</dt>
                                    <dd> Bugfix: Fehlende Zeichensatzangabe "CHARSET=" bei kodiertem Text "ENCODING=" in der VCF - Kontaktdatei f&#252;hrte zum Programmabsturz.</dd>
                                    <dd> Optionale &#196;nderung des Datumsformates</dd>
                                    <dt>EasyKontakt 0.1-48</dt>
                                    <dd> Export zu .xml (FritzBox): Tags &lt;undefined&gt; aus XML entfernt -> Datei wird kleiner und &#252;bersichtlicher</dd>
                                    <dd> Export zu .xml (FritzBox): &#196;nderung der Namen von "Nachname, Vorname" nach "Vorname Nachname" </dd>
                                    <dt>EasyKontakt 0.1-46</dt>
                                    <dd> Undo: Aktuelle &#196;nderungen r&#252;ckg&#228;ngig machen</dd>
                                    <dt>EasyKontakt 0.1-42</dt>
                                    <dd> Speichern einer selektiven Kontaktliste nach Benutzerauswahl</dd>
                              </dl>
                        </div>
                        <div class="menu_right">
                              
                              <div class="menubox">
                                    <div class="menuheader">
                                          Inhalt dieser Seite
                                    </div>
                                    <div class="list">
                                          <a href="EasyKontakt.html"><img src="img/blind.gif" width="0" height="10">Top</a>
                                          <a href="#Features"><img src="img/blind.gif" width="0" height="10">Features</a>
                                          <a href="#Screenshot"><img src="img/blind.gif" width="0" height="10">Screenshot</a>
                                          <a href="#Beschreibung"><img src="img/blind.gif" width="0" height="10">Beschreibung</a>
                                          <a href="#Kontaktauswahl"><img src="img/blind.gif" width="10" height="10">Kontaktauswahl</a>
                                          <a href="#Datenauswahl"><img src="img/blind.gif" width="10" height="10">Datenauswahl</a>
                                          <a href="#Datumsformat"><img src="img/blind.gif" width="0" height="10">Datumsformat</a>
                                          <a href="#Konfiguration"><img src="img/blind.gif" width="0" height="10">Konfiguration</a>
                                          <a href="#StyleSheet"><img src="img/blind.gif" width="0" height="10">StyleSheet</a>
                                          <a href="#Changelog"><img src="img/blind.gif" width="0" height="10">Changelog</a>
                                    </div>
                                    <div class="menufooter">
                                          <!--  lass die Zeile drin f&#252;r IE6 -->
                                    </div>
                              </div>
                              
                              04.04.2019 - 19:42:38<br />
                              Created by EasyWebitor
                              
                        </div>
                  </div>
            </div>
      </body>
</html>